## 4.4 Data Wrangling & Subsetting

### 4.4.1 Import libraries & datasets

In [281]:
import pandas as pd
import numpy as np
import os

project_path = r'C:\Users\cneva\06-2024 Instacart Basket Analysis'
df_prods = pd.read_csv(os.path.join(project_path,'02 Data','Original Data', 'products.csv'))
df_ords = pd.read_csv(os.path.join(project_path,'02 Data','Original Data', 'orders.csv'))
df_dep = pd.read_csv(os.path.join(project_path, '02 Data','Original Data','departments.csv'))

### 4.4.2 Dropping columns

In [283]:
df_ords = df_ords.drop(columns = ['eval_set'])

In [284]:
df_ords['days_since_prior_order'].value_counts(dropna = False)

days_since_prior_order
30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: count, dtype: int64

### 4.4.3 Renaming Columns

In [286]:
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

### 4.4.3 Changing a Variable's Data Type

In [288]:
df_ords['order_id'] = df_ords['order_id'].astype('str')

### 4.4.4 Transposing Data

In [290]:
df_dep_t = df_dep.T

In [291]:
df_dep_t.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [292]:
new_header = df_dep_t.iloc[0]

In [293]:
df_dep_t_new = df_dep_t[1:]

In [294]:
df_dep_t_new.columns = new_header

### 4.4.5 Data Dictionaries

In [296]:
data_dict = df_dep_t_new.to_dict('index')

### 4.4.6 Subsetting

In [298]:
df_snacks = df_prods[df_prods['department_id'] == 19]
df_snacks_2 = df_prods.loc[df_prods['department_id'] == 19]
df_snacks_3 = df_prods.loc[df_prods['department_id'].isin([19])]

### 4.4.7 Exporting Dataframes

In [300]:
# df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

# 4.4 Task

#### 2. Find another identifier variable in the df_ords dataframe that doesn’t need to be included in your analysis as a numeric variable and change it to a suitable format.

In [303]:
df_ords['user_id'] = df_ords['user_id'].astype('str')

#### 3. Look for a variable in your df_ords dataframe with an unintuitive name and change its name without overwriting the dataframe.

In [305]:
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = False)

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

#### 4. Your client wants to know what the busiest hour is for placing orders. Find the frequency of the corresponding variable and share your findings.
#### - 10 am is the busiest hour of the day

In [307]:
df_ords['order_hour_of_day'].value_counts(dropna = False)

order_hour_of_day
10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: count, dtype: int64

#### 6. The sales team in your client’s organization wants to know more about breakfast item sales. Create a subset containing only the required information.

In [309]:
df_dep_t_new[df_dep_t_new['department'] == 'breakfast']

department_id department
14             breakfast

In [310]:
df_prods_breakfast = df_prods[df_prods['department_id'] == 14]

#### 7. They’d also like to see details about products that customers might use to throw dinner parties. Your task is to find all observations from the entire dataframe that include items from the following departments: alcohol, deli, beverages, and meat/seafood. You’ll need to present this subset to your client.

In [312]:
df_dep_t_new[df_dep_t_new['department'].isin(['alcohol','deli','beverages','meat seafood'])]

department_id    department
5                   alcohol
7                 beverages
12             meat seafood
20                     deli

In [313]:
df_prods_dinner_parties = df_prods[df_prods['department_id'].isin([5,7,12,20])]

#### # 8. It’s important that you keep track of total counts in your dataframes. How many rows does the last dataframe you created have?
#### - There are 7650 rows

In [315]:
df_prods_dinner_parties.shape
# There are 7650 rows

(7650, 5)

#### 9. Someone from the data engineers team in Instacart thinks they’ve spotted something strange about the customer with a "user_id" of “1.”  Extract all the information you can about this user.
#### - user_id 1 always places orders at the beginning of the week, usually early in the morning / early afternoon.  Orders are placed every 2-4 weeks apart

In [317]:
df_ords_customer1 = df_ords[df_ords['user_id'] == '1']
df_ords_customer1

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

In [318]:
df_ords_customer1.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,11.000000,11.000000,11.000000,10.000000
mean,6.000000,2.636364,10.090909,19.000000
std,3.316625,1.286291,3.477198,9.030811
min,1.000000,1.000000,7.000000,0.000000
25%,3.500000,1.500000,7.500000,14.250000
50%,6.000000,3.000000,8.000000,19.500000
75%,8.500000,4.000000,13.000000,26.250000
max,11.000000,4.000000,16.000000,30.000000

#### 12. Export your df_ords dataframe as “orders_wrangled.csv” in your “Prepared Data” folder.

In [355]:
df_ords.to_csv(os.path.join(project_path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))

In [347]:
df_dep_t_new.to_csv(os.path.join(project_path,'02 Data', 'Prepared Data', 'departments_wrangled.csv'))